/*
	
  ******************************************************************************
  * @file 			( фаил ):   delays.h
  * @brief 		( описание ):  	
  ******************************************************************************
  * @attention 	( внимание ):
  ******************************************************************************
  
*/

//####  SETUP  #####################################
/*

	для использования функциии ожидания в микросекундах Delay_us()
	считать будем по таймеру
	для етого в CubeMX инициализируем таймер Clock Sourse -> Internal Clock
	в прескалере ставим делитель равным частоте щины таймера например 
	при частоте 72МГц ставим 72 - 1 = 71
	а в 16 битном счетчике ставим максималку 65536 - 1 = 65535 ( далее ето значение меняеться при вызове Delay_us() )
	таким образом получаем 72 000 000 / 72 = 1 000 000 раз в секунду тикает
	
	привызове функции Delay_us() в параметре указываем счетчик новый сколько тиков считать 
	что и будет значение равное микросекуднам
	
	также ниже указываем хендел нашего таймера:
	//====================================
		#define  TIMER_US	htim1
	//====================================


*/
//##################################################


#ifndef _DELAYS_H
#define _DELAYS_H

#ifdef __cplusplus
extern "C" {
#endif
	
#include "main.h"

//======  SETUP ======================
	#define  TIMER_US	htim1
//====================================


//===============================================================================================

void Delay_us(uint16_t us);

//===============================================================================================


#ifdef __cplusplus
}
#endif

#endif	/*	_TEST_H */

/************************ (C) COPYRIGHT GKP *****END OF FILE****/
